Revit 2027 API
ParameterTypeId.DiameterSymbolLocation Property
 "Diameter Symbol Location"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DiameterSymbolLocation { get; }
Public Shared ReadOnly Property DiameterSymbolLocation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DiameterSymbolLocation {
	ForgeTypeId^ get ();
}
static member DiameterSymbolLocation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace